In [100]:
import pandas as pd
import numpy as np

In [101]:
#Criar um DataFrame com o dataset https://people.sc.fsu.edu/~jburkardt/data/csv/zillow.csv definindo os nomes das colunas como index, space, beds, baths, zip, year e list_price;

df = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/zillow.csv')

df.columns = ['index', 'space', 'beds', 'baths', 'zip', 'year', 'list_price']

print(df.head())

print(df.shape)

   index  space  beds  baths    zip  year  list_price
0      1   2222     3    3.5  32312  1981      250000
1      2   1628     3    2.0  32308  2009      185000
2      3   3824     5    4.0  32312  1954      399000
3      4   1137     3    2.0  32309  1993      150000
4      5   3560     6    4.0  32309  1973      315000
(20, 7)

In [102]:
#Mostrar a quantidade de casas (space) por número de quartos (quartos é a coluna Bed);


df[['beds','space']].groupby('beds').count()

      space
beds
2         1
3         7
4         7
5         4
6         1

In [103]:
#Mostrar o valor médio das casas (list_price) por número de quartos (beds);

df[['beds', 'list_price']].groupby('beds').mean()

         list_price
beds
2      89000.000000
3     220428.571429
4     501142.857143
5     553450.000000
6     315000.000000

In [104]:
#Criar uma função de agregação que retorne o valor médio da quantidade de quartos e do preço dos imóveis.
def media(arr):
    return arr.mean()

df[['beds','list_price']].agg(media)

beds               3.85
list_price    383440.00
dtype: float64

In [105]:
#Criar uma função de agregação que retorne o valor médio da quantidade de quartos e do preço dos imóveis.
def media(arr):
    return arr.mean()

df[['beds','list_price']].agg(media)

beds               3.85
list_price    383440.00
dtype: float64

In [106]:
string_data = pd.Series(['valor 1', 'valor 2', np.nan, 'valor 3'])
string_data

0    valor 1
1    valor 2
2        NaN
3    valor 3
dtype: object

In [107]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [108]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [109]:
string_data[0] = None
string_data

0       None
1    valor 2
2        NaN
3    valor 3
dtype: object

In [110]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [111]:
string_data.dropna()

1    valor 2
3    valor 3
dtype: object

In [112]:
string_data[string_data.notnull()]

1    valor 2
3    valor 3
dtype: object

In [113]:
string_data.fillna(0)

0          0
1    valor 2
2          0
3    valor 3
dtype: object

In [114]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [115]:
string_data.fillna(method='ffill')

C:\Users\47131502023.1\AppData\Local\Temp\ipykernel_19892\68446736.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  string_data.fillna(method='ffill')

0       None
1    valor 2
2    valor 2
3    valor 3
dtype: object

In [116]:
string_data.fillna(method='bfill')

C:\Users\47131502023.1\AppData\Local\Temp\ipykernel_19892\2723876725.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  string_data.fillna(method='bfill')

0    valor 2
1    valor 2
2    valor 3
3    valor 3
dtype: object

In [117]:
data = pd.DataFrame([[1, 6.5, 3], [1, np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [118]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [119]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [120]:
data[4] = np.NaN
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [121]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [122]:
data.dropna(thresh=2)

     0    1    2   4
0  1.0  6.5  3.0 NaN
3  NaN  6.5  3.0 NaN

In [123]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [124]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [125]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [126]:
data = pd.Series([1, -999, 2, -999, 3, -1000, 4])
data

0       1
1    -999
2       2
3    -999
4       3
5   -1000
6       4
dtype: int64

In [127]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4       3.0
5   -1000.0
6       4.0
dtype: float64

In [128]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    NaN
6    4.0
dtype: float64

In [129]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    0.0
6    4.0
dtype: float64

In [130]:
val = 'a,b, resilia'

In [131]:
val.split(',')

['a', 'b', ' resilia']

In [132]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'resilia']

In [133]:
val.replace(',', '::')

'a::b:: resilia'

In [134]:
val.replace(',','')

'ab resilia'

In [135]:
data = pd.DataFrame({'k1': ['$ one', '$ two'] * 3 + ['$ two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

      k1  k2
0  $ one   1
1  $ two   1
2  $ one   2
3  $ two   3
4  $ one   3
5  $ two   4
6  $ two   4

In [136]:
data['k1'].str.split('$')

0    [,  one]
1    [,  two]
2    [,  one]
3    [,  two]
4    [,  one]
5    [,  two]
6    [,  two]
Name: k1, dtype: object

In [137]:
data['k1'].str.strip('$')

0     one
1     two
2     one
3     two
4     one
5     two
6     two
Name: k1, dtype: object

In [138]:
data['k1'].str.replace('$', ',', regex=True)

0    $ one,
1    $ two,
2    $ one,
3    $ two,
4    $ one,
5    $ two,
6    $ two,
Name: k1, dtype: object

## Atividade 1
#### ➔ O QUE FAZER?
Imaginem o cenário em que vocês tenham o seguinte dataset:
pd.DataFrame({"numbers": ["#23", "#24", "#18", "#14", "#12", "#10", "#35"],
"nums": ["23", "24", "18", "14", np.nan, "XYZ", "35"],
"colors": ["green", "red", "yellow", "orange", "purple", "blue", "pink"],
"other_column": [0, 1, 0, 2, 1, 0, 2]})

In [139]:
df = pd.DataFrame({"numbers": ["#23", "#24", "#18", "#14", "#12", "#10", "#35"],
"nums": ["23", "24", "18", "14", np.nan, "XYZ", "35"],
"colors": ["green", "red", "yellow", "orange", "purple", "blue", "pink"],
"other_column": [0, 1, 0, 2, 1, 0, 2]})

df

  numbers nums  colors  other_column
0     #23   23   green             0
1     #24   24     red             1
2     #18   18  yellow             0
3     #14   14  orange             2
4     #12  NaN  purple             1
5     #10  XYZ    blue             0
6     #35   35    pink             2

## Atividade 1
#### ➔ COMO FAZER?
Realizar a análise de dados de modo que respondam as seguintes perguntas:
1. Como vocês fariam para calcular a média da coluna numbers?
1. Como vocês calculariam a média da coluna num?
1. Como vocês removeriam as linhas que contém o valor 0 na coluna other_column?
1. Crie uma coluna chamada colors_upper com os elementos da coluna colors com todas as
letras maiúsculas.
Em grupos de 3 a 4 pessoas.

In [140]:
df['numbers'].str.strip('#').astype(int).mean()

19.428571428571427

In [141]:
df['nums'].replace(['XYZ'], np.nan).fillna(0).astype(int).mean()

16.285714285714285

In [142]:
df[df['other_column'] != 0]

  numbers nums  colors  other_column
1     #24   24     red             1
3     #14   14  orange             2
4     #12  NaN  purple             1
6     #35   35    pink             2

In [143]:
df['colors_upper'] = df['colors'].str.upper()
df

  numbers nums  colors  other_column colors_upper
0     #23   23   green             0        GREEN
1     #24   24     red             1          RED
2     #18   18  yellow             0       YELLOW
3     #14   14  orange             2       ORANGE
4     #12  NaN  purple             1       PURPLE
5     #10  XYZ    blue             0         BLUE
6     #35   35    pink             2         PINK

## Atividade 2
#### ➔ O QUE FAZER?
Apresentar o código para cada uma dessas perguntas a seguir:
#### ➔ COMO FAZER?
1. Vamos carregar um novo dataset: restaurant.csv
2. Quanto items nulos (e.g., NA, NaN) possuem no dataset?
3. Quanto items nulos (e.g., NA, NaN) existem em cada coluna?
4. Qual a média de preço dos itens que contém Chicken? (desafio)

In [149]:
df['numbers'].str.strip('#').astype(int).mean()

19.428571428571427

In [148]:
values = df['nums'].replace('XYZ',np.nan)
values = values.dropna()
values.astype(int).mean()

22.8

In [146]:
df.drop(df.loc[df['other_column']==0].index)

  numbers nums  colors  other_column colors_upper
1     #24   24     red             1          RED
3     #14   14  orange             2       ORANGE
4     #12  NaN  purple             1       PURPLE
6     #35   35    pink             2         PINK

In [147]:
df_copy = df.copy()
df_copy['colors_upper'] = df_copy['colors'].str.upper()
df_copy

  numbers nums  colors  other_column colors_upper
0     #23   23   green             0        GREEN
1     #24   24     red             1          RED
2     #18   18  yellow             0       YELLOW
3     #14   14  orange             2       ORANGE
4     #12  NaN  purple             1       PURPLE
5     #10  XYZ    blue             0         BLUE
6     #35   35    pink             2         PINK

In [150]:
restaurante = pd.read_csv('../csv/restaurante.csv')

In [151]:
restaurante.isna().sum().sum()

1246

In [152]:
print(restaurante.isna().sum())

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

In [153]:
def busca(df: pd.DataFrame, substring: str, case: bool = False) -> pd.DataFrame:
    busca = np.column_stack([df[col].astype(str).str.contains(substring.lower(), case=case, na=False) for col in df])
    return df.loc[busca.any(axis=1)]

media = busca(restaurante, 'Chicken')
media_filtro = media.item_price.str.replace('$', '', regex=True)
media_filtro.astype(float).mean()

ValueError: could not convert string to float: '$16.98'